cassettes/Create_payment_on_successful_charge/creates_the_payment_with_reference_id.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_198YnfFu8RB24okGgqSYXp5Q
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.55.0
      Authorization:
      - Bearer sk_test_Hj66ggJNipYBdJNvdJK83fEU
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.55.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.4.0-45-generic (buildd@lgw01-34) (gcc version 5.4.0 20160609 (Ubuntu
        5.4.0-6ubuntu1~16.04.2) ) #66-Ubuntu SMP Wed Oct 19 14:12:37 UTC 2016","hostname":"michaelmentele-Satellite-C75D-B"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 25 Oct 2016 23:14:07 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2262'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_9RXBeEaCgRcKEB
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_198YnfFu8RB24okGgqSYXp5Q",
          "object": "event",
          "api_version": "2016-07-06",
          "created": 1477416803,
          "data": {
            "object": {
              "id": "ch_198YnfFu8RB24okGbodFTuk7",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application_fee": null,
              "balance_transaction": "txn_198YnfFu8RB24okGxQUUsU6d",
              "captured": true,
              "created": 1477416803,
              "currency": "usd",
              "customer": "cus_9RRhZMe8oGhlOL",
              "description": null,
              "destination": null,
              "dispute": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": "in_198YnfFu8RB24okGlrbC1w9q",
              "livemode": false,
              "metadata": {},
              "order": null,
              "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "seller_message": "Payment complete.",
                "type": "authorized"
              },
              "paid": true,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_198YnfFu8RB24okGbodFTuk7/refunds"
              },
              "review": null,
              "shipping": null,
              "source": {
                "id": "card_198YneFu8RB24okGpfKPKExg",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_9RRhZMe8oGhlOL",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 11,
                "exp_year": 2016,
                "fingerprint": "E3jTfASODt8V0ox6",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "source_transfer": null,
              "statement_descriptor": null,
              "status": "succeeded"
            }
          },
          "livemode": false,
          "pending_webhooks": 0,
          "request": "req_9RRhmuaE41nqaq",
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Tue, 25 Oct 2016 23:14:07 GMT
recorded_with: VCR 2.9.3
